<template>
  <div class="about" v-html="renderedMarkdown"></div>
</template>

<script>
import MarkdownIt from 'markdown-it';
export default {
  name: "AboutIndex",
  data() {
    return {
      markdown: '**产品介绍：华为云端云协同AI开发套件及Jetson系列开发板应用方案**\n' +
          '\n' +
          '我们的产品是基于市场上常用的开发板，包括华为云端云协同AI开发套件、Jetson TX2 NX、Jetson Nano以及昇腾Atlas 200I DK A2。我们通过不同的开发方法和技术，实现了高效的模型优化、推理加速以及前端交互展示，为开发者提供了强大的开发工具和环境。\n' +
          '\n' +
          '**产品功能介绍：**\n' +
          '\n' +
          '1. **模型优化与推理加速：** 我们针对不同开发板选用了不同的优化方法。对于华为云端云协同AI开发套件和昇腾Atlas 200I DK A2，我们采用了ModelBox进行模型开发，以实现高效的推理性能。而对于Jetson系列，我们使用DeepStream 6.0.1和C语言进行开发，应用了量化、蒸馏、batch推理等技术，从而在不同硬件上实现了优化的模型推理。\n' +
          '2. **多项推理技术应用：** 我们在Jetson系列上采用了异步、多线程、pipeline并行推理等技术，提升了推理效率。同时，我们实现了OTA（在与华为云的协同下进行在线模型训练更新）、SR（自动录取一段视频保存）等功能，为用户提供更加智能的体验。\n' +
          '3. **前端展示与交互：** 我们通过利用WebSocket和RTSP视频流输出，实现了可供展示并且可交互的前端界面。用户可以实时观看模型的推理结果，并与前端界面进行交互，获得更多的信息。\n' +
          '\n' +
          '**产品开发过程简介：**\n' +
          '\n' +
          '我们的产品开发从8月8日开始，经过近一个月的努力，于9月5日基本完成了开发工作。在开发过程中，我们充分利用了各种硬件平台的特点，选用了不同的开发方法和技术，以实现高效的模型优化和推理。\n' +
          '\n' +
          '**团队成员工作介绍：**\n' +
          '\n' +
          '我们的团队由八位本科生和两位硕士研究生组成，依托于华中科技大学计算机科学与技术学院存储所，由周健副教授担任指导老师。\n' +
          '\n' +
          '- **队长：张恭博**（大二）负责DeepStream、模型更新、检测时序算法设计、SR、OTA、pipeline、多线程开发。\n' +
          '- **队员：郭树明**（大二）主要负责模型设计及训练。\n' +
          '- **队员：吕露然**（大三）主要负责帧逻辑判断和ModelBox开发。\n' +
          '- **队员：张奥琳**（大一）主要负责模型验证、心跳包开发以及数据清洗。\n' +
          '- **队员：陈星宇**（大二）主要负责模型验证和前后端交互开发。\n' +
          '- **队员：吴锦添**（研一）主要负责模型设计、时序信息处理、端云协同开发以及模型在线实时训练流程设计。\n' +
          '- **队员：贾雨凡**（研一）主要负责模型设计、时序信息处理、端云协同开发、docker制作以及模型在线实时训练流程设计。\n' +
          '- **队员：周喆宇**（大二）主要负责模型验证和UI设计与开发。\n' +
          '- **队员：张家豪**（大二）主要负责模型验证、UI设计与开发以及前后端交互。\n' +
          '- **队员：张锦深**（大二）主要负责DeepStream pipeline开发和工程粘合。\n' +
          '\n' +
          '通过团队成员的紧密合作和分工，我们成功开发了基于不同开发板的功能强大的AI开发套件，为用户提供了高效、智能的开发和体验环境。',
      renderedMarkdown: ''
    };
  },
  mounted() {
    this.renderMarkdown();
  },
  methods: {
    renderMarkdown() {
      const md = new MarkdownIt();
      this.renderedMarkdown = md.render(this.markdown);
    }
  }
}
</script>

<style scoped>
.about{
  width: 70%;
  margin: 0 auto;
}
</style>